# 1) Написать список мужских и женских имен, вывести только женские имена

names = ['Артем', 'Вадим', 'Вика', 'Стеша', 'Яна', 'Максим']
print(names[2], names[3], names[4])

# 2) Написать генератор списка, который создаст список, состоящий только из элементов с нечётным количеством цифр

a = [i for i in range(1, 5)]
print(a)


