'''
Написать лямбда функцию, которая делит по
модулю(%) два аргумента.
'''

print((lambda a, b: a % b)(20, 7))